## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 
```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                               |
|--------|-----------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.sqs-priority-queue-delay-critical` |
|        | `aws_cloudwatch_metric_alarm.sqs-priority-queue-delay-warning`  |
| update | `aws_cloudwatch_metric_alarm.sqs-sms-stuck-in-queue-critical`   |
|        | `aws_cloudwatch_metric_alarm.sqs-sms-stuck-in-queue-warning`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.sqs-priority-queue-delay-critical will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs-priority-queue-delay-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ]
      + alarm_description                     = "ApproximateAgeOfOldestMessage in high priority queue >= 60 seconds for 1 minute"
      + alarm_name                            = "sqs-priority-queue-delay-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "eks-notification-canada-capriority-tasks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 60
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sqs-priority-queue-delay-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs-priority-queue-delay-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "ApproximateAgeOfOldestMessage in high priority queue >= 20 seconds for 3 minutes"
      + alarm_name                            = "sqs-priority-queue-delay-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "eks-notification-canada-capriority-tasks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 20
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sqs-sms-stuck-in-queue-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-sms-stuck-in-queue-critical" {
      ~ alarm_description         = "ApproximateAgeOfOldestMessage in SMS queue is older than 1 minute for 10 minutes" -> "ApproximateAgeOfOldestMessage in SMS queue is older than 15 minutes for 5 minutes"
      ~ evaluation_periods        = 10 -> 5
        id                        = "sqs-sms-stuck-in-queue-critical"
        tags                      = {}
      ~ threshold                 = 60 -> 900
        # (15 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sqs-sms-stuck-in-queue-warning will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "sqs-sms-stuck-in-queue-warning" {
      ~ alarm_description         = "ApproximateAgeOfOldestMessage in SMS queue is older than 1 minute in a 5-minute period" -> "ApproximateAgeOfOldestMessage in SMS queue is older than 10 minutes in a 5 minutes"
      ~ evaluation_periods        = 1 -> 5
        id                        = "sqs-sms-stuck-in-queue-warning"
      ~ period                    = 300 -> 60
        tags                      = {}
      ~ threshold                 = 60 -> 600
        # (14 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-sms-created-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
